In [1]:
import pandas as pd
import sqlite3

In [2]:
connection = sqlite3.connect("./data/suministros.db")
cursor = connection.cursor()

# Miramos los nombres de los proveedores

In [3]:
query = '''    
SELECT nombre
FROM proveedores
'''

pd.read_sql(query, connection)

               nombre
0             Grupale
1             Herraca
2    Maquinas Navarro
3            Reparmur
4  Excavaciones Tomas
5            Servired

# Miramos en la tabla suministros cuántos proveedores nos sirven la pieza con el "id 1".

In [4]:
query = '''   
SELECT *
FROM suministros 
WHERE pieza_id = 1
'''
pd.read_sql(query, connection)

   suministro_id  pieza_id  proveedor_id  cantidad       fecha
0              1         1             1       100  01/02/2024
1              2         1             2       450  02/02/2024
2             11         1             5      1200  11/02/2024

# Vemos el color real de las piezas, no solo su código. Para ellos hacemos un LEFT JOIN de la tabla piezas y colores.

In [5]:
query = '''   
SELECT  p.*, c.color
FROM piezas AS p
LEFT JOIN colores AS c
ON p.color_id = c.color_id
'''
pd.read_sql(query, connection)

   pieza_id   nombre  color_id  precio  categoria_id     color
0         1  Pieza_1         1     5.0             2     negro
1         2  Pieza_2         1    15.0             2     negro
2         3  Pieza_3         1     4.0             3     negro
3         4  Pieza_4         4    52.0             3      azul
4         5  Pieza_5         3     9.0             5      rojo
5         6  Pieza_6         6    45.0             6  amarillo

# Vemos cuántos proveedores son de Madrid, qué cantidad de piezas nos suministran y en qué fechas

In [6]:
query = '''   
SELECT  p.nombre, s.cantidad, s.fecha
FROM proveedores AS p
LEFT JOIN suministros AS s
ON p.proveedor_id = s.proveedor_id
WHERE ciudad = "Madrid"
'''
pd.read_sql(query, connection)

     nombre  cantidad       fecha
0  Reparmur       120  10/02/2024
1  Reparmur       740  04/02/2024